000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/АннуляцияПродажи/АннуляцияПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АннуляцияПродажи</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </resources>
  <resources>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </resources>
  <resources>
    <name>СтатусЧекаККМ</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </resources>
  <resources>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Администратор</name>
    <comment>Признак наличия роли &quot;Администраторсистемы&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСтруктуры</name>
    <type>
      <types>CatalogRef.СтруктураУзлов</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/АннуляцияПродажи/ManagerModule.bsl
//	LNK 27.05.2019 15:29:27
Процедура Регистрация(ДокументПродажи, ПериодРегистрации, СтатусЧекаККМ, Магазин, КассаККМ, КассоваяСмена, Продавец, Номенклатура, Упаковка, Количество, Цена, Сумма, Компьютер)	Экспорт

	Попытка

		НаборЗаписей = РегистрыСведений.АннуляцияПродажи.СоздатьНаборЗаписей();
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);

		НаборЗаписей.Отбор.Период.Установить(?(ЗначениеЗаполнено(ПериодРегистрации), ПериодРегистрации, ТекущаяДатаСеанса()));
		НаборЗаписей.Отбор.ДокументПродажи.Установить(ДокументПродажи);
		НаборЗаписей.Отбор.Индекс.Установить(РегистрыСведений.АннуляцияПродажи.ПолучитьИндекс(НаборЗаписей.Отбор.Период.Значение, ДокументПродажи));

		ЗаписьНабора = НаборЗаписей.Добавить();

		ЗаписьНабора.Период          = НаборЗаписей.Отбор.Период.Значение;
		ЗаписьНабора.ДокументПродажи = НаборЗаписей.Отбор.ДокументПродажи.Значение;
		ЗаписьНабора.Индекс          = НаборЗаписей.Отбор.Индекс.Значение;

		ЗаписьНабора.Магазин       = Магазин;
		ЗаписьНабора.КассаККМ      = КассаККМ;
		ЗаписьНабора.КассоваяСмена = КассоваяСмена;
		ЗаписьНабора.СтатусЧекаККМ = СтатусЧекаККМ;
		ЗаписьНабора.Номенклатура  = Номенклатура;
		ЗаписьНабора.Упаковка      = Упаковка;
		ЗаписьНабора.Продавец      = Продавец;
		ЗаписьНабора.Количество    = Количество;
		ЗаписьНабора.Цена          = Цена;
		ЗаписьНабора.Сумма         = Сумма;

		ЗаписьНабора.Компьютер     = Компьютер;

		ЗаписьНабора.Администратор = РольДоступна(Метаданные.Роли.АдминистраторСистемы);

		НаборЗаписей.Записать();

	Исключение

		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("РегистрыСведений.АннуляцияПродажи", УровеньЖурналаРегистрации.Предупреждение
		, Метаданные.РегистрыСведений.АннуляцияПродажи,, ТекстОшибки);

	КонецПопытки;

КонецПроцедуры

//	LNK 28.05.2019 13:08:12
Функция ПолучитьИндекс(Период, ДокументПродажи)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаРегистра.Индекс) КАК Индекс
	|ИЗ
	|	РегистрСведений.АннуляцияПродажи КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период = &Период
	|	И ТаблицаРегистра.ДокументПродажи = &ДокументПродажи"
	);
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("ДокументПродажи"	, ДокументПродажи);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() И НЕ Выборка.Индекс = NULL Тогда

			Индекс = Выборка.Индекс + 1;

	Иначе	Индекс = 0;

	КонецЕсли;

	Возврат Индекс;

КонецФункции // ПолучитьИндекс()
